<template>
  <div>
    <Doc :markdownContent="content"/>
  </div>
</template>

<script setup lang="ts">
  import Doc from "@/components/Doc.vue";

  const content = `

# 科学计算器
[[TOC]]
欢迎使用金融计算器-科学计算器部分！  
本科学计算器支持多种数学运算功能，能够满足日常运算需要。

## 主要功能

- **基本运算**：支持加（\`+\`）、减（\`-\`）、乘（\`×\`）、除（\`÷\`）。
- **高级运算**：
  - 幂运算（\`x²\` 和 \`^\`）。
  - 绝对值（\`|x|\`）。
  - 三角函数（\`sin\`、\`cos\`、\`tan\`），并处理了 \`tan\` 的特殊角度。
  - 常数（\`π\` 和 \`e\`）。
  - 开方（\`√x\`）和阶乘（\`x!\`）。
- **精度控制**：通过 \`mathjs\` 对结果精度进行控制，确保输出的数值精度符合用户设置。
- **操作历史**：记录上一次计算结果，可以直接调用（\`Ans\`）。
- **输入清空和删除**：支持逐个字符删除（\`DEL\`）和全部清空（\`AC\`）。

`;

  
</script>
