<template>
  <div>
    <Doc :markdownContent="content"/>
  </div>
</template>

<script setup lang="ts">
  import Doc from "@/components/Doc.vue";

  const content = `

# 科学计算器
[[TOC]]
欢迎使用金融计算器-科学计算器部分！  
本科学计算器支持多种数学运算功能，能够满足日常运算需要。

## 主要功能

- **基本运算**：支持加（\`+\`）、减（\`-\`）、乘（\`×\`）、除（\`÷\`）。
- **高级运算**：
  - 幂运算和指数运算（\`x²\` 和 \`^\`）。
  - 自然对数运算（log）
  - 绝对值（\`|x|\`）。
  - 三角函数（\`sin\`、\`cos\`、\`tan\`），并处理了 \`tan\` 的特殊角度。
  - 反三角函数（\`arcsin\`、\`arccos\`、\`arctan\`）
  - 常数（\`π\` 和 \`e\`）。
  - 开方（\`√x\`）和阶乘（\`x!\`）。
  - 排列数和组合数
- **分数和小数转化**：如果计算结果可以转化为分数，将会弹出小数和分数互相转化的选项开关
- **键盘输入/鼠标输入**：考虑到一些用户喜欢键盘输入，计算器对所有按钮都设置了热键。右上角的选项按钮可以选择输入方式（键盘输入/鼠标输入）。在键盘输入下，相关按钮设置了快捷键提示，没有关键词提示的按钮快捷键同按钮本身相同。在鼠标输入下，按钮大小会更大更清晰，方便用户点击输入
- **精度控制**：可以自行调节保留小数个数，确保输出的数值精度符合用户设置。
- **操作历史**：记录上一次计算结果，可以直接调用（\`Ans\`）。
- **输入清空和删除**：支持逐个字符删除（\`DEL\`）和全部清空（\`AC\`）。
- **角度制和弧度制**：在三角函数的运算过程，可以自行选择角度制和弧度制

## 示例

输入：2^(2^(2)) + 7 * 2 + pi。输入会被渲染成 $$2^{2^{2}}+7 \\times 2+\\pi$$

结果：33.14

## 快捷键
- \`esc\`: 弧度制和角度制转化
- \`ctrl + enter\`: 小数和分数转化
- \` : 鼠标输入和键盘输入模式转化
## 注意事项

- 所有计算采用 **AOS 模式**，不支持 **CHN 模式**（链式计算模式）
- 用户输入的公式渲染机制采用**右括号匹配原则**。例如只有输入 2^(2) 才能正常渲染，而输入 2^(2 会保留原格式展示
- 计算方式同样采用**括号匹配原则**，若有括号没有闭合，将无法正常计算
- 只有当计算结果可以转化为分数的时候，才会弹出分数和小数互相转化的开关（不包括无限循环小数、无限不循环小数、无理数……）
- 对于无法正常计算的结果将会返回 Error
`;

  
</script>
