<template>
  <div>
    <Doc :markdownContent="content"/>
  </div>
</template>

<script setup lang="ts">
  import Doc from "@/components/Doc.vue";
  const content = 
  `
  # 现金流计算器
  [[TOC]]

  现金流分析是评估投资项目财务可行性的重要工具。通过计算NPV、IRR和PI，投资者可以更好地理解项目的价值和风险，从而做出明智的投资决策。

  ## 功能介绍
  该计算器可以根据提供的现金流数据，计算出每一项的净现值（NPV）、内部收益率（IRR）和盈利指数（PI）

  此类计算器分为两个模块：

  - 周期性现金流：现金的支出/收入都是**定期进行**的
  - 不规则现金流：可以输入**任意日期**下的现金流

  每个模块下总共有三个功能：
  - 计算输入现金流的净现值（NPV）、内部收益率（IRR）、盈利指数（PI）
  - 实时展示输入的现金流的现金流量图，更直观，更遍历
  - 以贴现率为敏感因子对净现值和盈利指数进行**敏感性分析**

  ## 相关指标介绍
  ### 净现值（Net Present Value, NPV）
  - **定义**：净现值是未来现金流的当前价值减去初始投资。
  - **计算公式**：$$ NPV = \\sum_{t=0}^{N} \\frac{C_t}{(1+r)^t} - C_0 $$
    其中，C_t 是第t期的现金流，r是折现率，C_0 是初始投资。
  - **解释**：如果NPV为正，表示投资的回报超过了资本成本，项目可行。如果NPV为负，则项目不可行。

  ### 内部收益率（Internal Rate of Return, IRR）
  - **定义**：内部收益率是使项目净现值等于零的折现率。
  - **计算方法**：求解方程 NPV = 0 的贴现率。
  - **解释**：IRR是投资的预期收益率。如果IRR高于投资者的资本成本或所需最低回报率，项目被认为是可行的。

  ### 盈利指数（Profitability Index, PI）
  - **定义**：盈利指数是未来现金流的现值与初始投资的比率。
  - **计算公式**：$$ PI = \\frac{未来现金流的现值之和}{初始投资} $$
  - **解释**：PI 大于 1 表示每投资一单位货币，可以产生超过一单位的货币的未来价值。PI小于 1 则表示项目不可行。

  ## 示例
  假设一个项目需要初始投资1000美元，未来5年内每年产生现金流500美元，折现率为10%。

  - **NPV计算**：
    $$ NPV = -1000 + \\frac{500}{(1+0.10)^1} + \\frac{500}{(1+0.10)^2} + \\frac{500}{(1+0.10)^3} + \\frac{500}{(1+0.10)^4} + \\frac{500}{(1+0.10)^5} $$
    $$ NPV \\approx -1000 + 454.55 + 412.33 + 373.44 + 337.37 + 304.13 $$
    $$ NPV \\approx 375.82 $$

  - **IRR计算**：求解方程 $$ -1000 + \\frac{500}{(1+r)^1} + \\frac{500}{(1+r)^2} + \\frac{500}{(1+r)^3} + \\frac{500}{(1+r)^4} + \\frac{500}{(1+r)^5} = 0 $$ 的r值。

  - **PI计算**：
    $$ PI = \\frac{454.55 + 412.33 + 373.44 + 337.37 + 304.13}{1000} $$
    $$ PI \\approx 1.8818 $$
  ## 注意事项
  - 确保所有现金流的正负号正确无误，通常现金流入为正，现金流出为负。
  - 在计算IRR时，可能会遇到多个解的情况，需要根据实际情况判断哪个解是合适的。
  - PI是一个相对指标，需要与1进行比较来判断项目的可行性。
  - 在高精度下，内部收益率可能会不准确
  `
</script>

<style>

</style>
