<template>
    <div>
      <Doc :markdownContent="content"/>
    </div>
  </template>
  
  <script setup lang="ts">
    import Doc from "@/components/Doc.vue";
  
    const content = `
# 储蓄计算器
[[TOC]]
欢迎使用储蓄计算器！
本储蓄计算器提供活期存款、定活两便、零存整取、存本取息 和 整存整取 五种存款方式的利息计算。  
写代码的时候保存是个好习惯，挣到了钱以后也要记得储存哦！  

以下是各类存款方式的介绍：

 ## 活期存款
 **定义**：活期存款是一种随时可以存取的存款，存款人可以根据需要随时提取或存入资金。  

**特点**：
流动性强，方便随时使用资金。  
利率相对较低，适合短期存款和应急资金的管理。  
没有固定的存款期限，利息按天数计算。   

**利率**：0.3%
 ## 定活两便
 **定义**：定活两便是一种既可以按定期存款计算利息，又可以在需要时提前支取的存款方式。


**特点**：
存款人在存期满之前支取时，按活期存款利率计息，满期后则按定期存款利率计息。  
适合对流动性要求较高但又希望获得定期利率收益的存款人。  

**利率**：  
3个月内：0.3%  
3至6个月：0.81%  
6个月至1年：0.93%  
1年以上：1.05%  

 ## 零存整取
 **定义**：零存整取是一种按月定期存入固定金额，到期一次性取出本金和利息的存款方式。  

**特点**：
适合有计划定期存款的人群，尤其是有规律收入的储户。  
可以选择1年、3年、5年的存期，定期按时存入，利息按定期存款利率计算。  
如果未按时存入，未存入部分不计利息。  

**利率**：  
一年：1.35%  
三年：1.55%  
五年：1.55%

 ## 存本取息
 **定义**：存本取息是一种在存款期内定期取出利息，到期后一次性取回本金的存款方式。

**特点**：
本金保持不变，储户定期按月、季度或年度领取利息，适合需要稳定利息收入的存款人。  
存款期限一般较长，通常为2年、3年或5年。 

**利率**：  
一年：1.35%  
三年：1.55%  
五年：1.55%

 ## 整存整取
 **定义**：定义：整存整取是将一定数额的资金一次性存入银行，存款到期后取回本金和利息的存款方式。  

**特点**：
存款利率高于活期存款，适合长期存放不急需使用的资金。  
存期一般有3个月、6个月、1年、2年、3年、5年等多种选择。  
存款期满后可一次性取回本金和利息，如需提前支取，提前支取部分按活期利率计息。    

**利率**：   
三个月：1.35%  
半年：1.55%  
一年：1.75%  
二年：2.25%  
三年：2.75%  
五年：2.75%  



 `;

  
</script>
