<template>
    <div>
      <Doc :markdownContent="content"/>
    </div>
  </template>
  
  <script setup lang="ts">
    import Doc from "@/components/Doc.vue";
  
    const content = `
# 个税计算器
[[TOC]]
欢迎使用个税计算器！
个税与每个人都息息相关，是工资中相当大的一笔开支，个税的计算可以帮助您更好实现财务管理。
 
  ## 功能介绍
  该计算器可以根据提供的工资和时间数据，计算出个人五险一金与所得税的总额，以及税后工资。

  该个税计算器分为两个模块：

  - 五险一金：根据工资和**社保、公积金基数**计算每月对应的保险和公积金总额
  - 个人所得税：根据我国的税务收取规则，输入月份和税前工资、专项扣除、计算出当前年已缴税费，待缴税费，从而得到当月应缴税费。
  
  ## 其他扣除
包括个人缴付符合国家规定的企业年金、职业年金，个人购买符合国家规定的商业健康保险、税收递延型商业养老保险的支出，以及国务院规定可以扣除的其他项目

  ## 专项附加扣除

  <table border="1" cellspacing="0" cellpadding="8">
  <tr>
    <th>项目</th>
    <th>扣除额</th>
  </tr>
  <tr>
    <td>子女教育和婴幼儿  

  包括学前教育、学历教育、3岁以下婴幼儿看护</td>
    <td>每个子女2000元/月</td>
  </tr>
  <tr>
    <td>继续教育  

包含职业资格教育和学历教育</td>
    <td>本人在学历教育期间，400/月  

本人取得职业资格继续教育证书，3600/年</td>
  </tr>
    <tr>
    <td>首套房贷利息  

本人或配偶首套房贷款利息</td>
    <td>本人或配偶首套房贷款且全部由我扣除，1000/月  

本人或配偶首套房贷款，且夫妻平分扣除，500/月</td>
  </tr>
    <tr>
    <td>租房租金    

同城，夫妻择一;不同城，分别抵扣</td>
    <td>直辖市、省会城市、计划单列市及国务院确定的其他城市，1500/月  

市辖区户籍人口超过100万，1100/月  

市辖区户籍人口不超过100万，800/月</td>
  </tr>
    <tr>
    <td>赡养老人  

60岁以上父母或祖辈</td>
    <td>独生子，3000/月  

非独生子，2个兄弟姐妹，1500/月  

非独生子，3个兄弟姐妹，1000/月  

非独生子，4个兄弟姐妹，750/月  

非独生子，5个兄弟姐妹，600/月  

可以由赠养人均摊或者约定分摊，也可以由被赡养人指定分摊。</td>
  </tr>
</table>

## 累计预扣预缴应纳税所得额

<table>
    <thead>
      <tr>
        <th>级数</th>
        <th>累计预扣预缴应纳税所得额</th>
        <th>预扣税率</th>
        <th>速算扣除数</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>1</td>
        <td>不超过36000元的部分</td>
        <td>3%</td>
        <td>0</td>
      </tr>
      <tr>
        <td>2</td>
        <td>超过36000元至144000元的部分</td>
        <td>10%</td>
        <td>2520</td>
      </tr>
      <tr>
        <td>3</td>
        <td>超过144000元至300000元的部分</td>
        <td>20%</td>
        <td>16920</td>
      </tr>
      <tr>
        <td>4</td>
        <td>超过300000元至420000元的部分</td>
        <td>25%</td>
        <td>31920</td>
      </tr>
      <tr>
        <td>5</td>
        <td>超过420000元至660000元的部分</td>
        <td>30%</td>
        <td>52920</td>
      </tr>
      <tr>
        <td>6</td>
        <td>超过660000元至960000元的部分</td>
        <td>35%</td>
        <td>85920</td>
      </tr>
      <tr>
        <td>7</td>
        <td>超过960000元的部分</td>
        <td>45%</td>
        <td>181920</td>
      </tr>
    </tbody>
  </table>

##  工资个税预扣预缴计算公式
当月个税 = （累计收入 - 累计五险一金 - 累计专项附加扣除 - 累计减除费用）x 预扣税率 - 速算扣除数 - 累计已缴纳税额

应纳税所得额= 累计税前工资收入 - 累计五险一金（个人缴纳部分） - 累计专项附加扣除 - 累计减除费用

累计应纳税额 = 应纳税所得额 x 税率 － 速算扣除数

当月应纳税额 = 累计应纳税额-累计已缴纳税额

累计减除费用 = 员工当年在职月数 x 5000

 
## 公积金、社保缴纳基数
公积金缴纳基数：

各单位应按照上海市统计局计算职工月平均工资的口径计算职工月平均工资，并以职工月平均工资作为该职工住房公积金缴存基数核定住房公积金月缴存额。各单位应在核定职工住房公积金月缴存额后一个月内，将核定情况告知职工本人，以维护职工的合法权益。

社保缴纳基数：

社保缴费基数是社会平均工资的60%--300%为缴纳基数，比如社会平均工资是1000元，缴纳的基数可以是600元--3000元。
  `;


</script>
<style scoped>
table {
  border-collapse: collapse;
  width: 100%;
}

table, th, td {
  border: 1px solid black;
  padding: 8px;
  text-align: center;
}
th {
  background-color: #f2f2f2;
}

</style>