<template>
  <div>
    <Doc :markdown-content="content"/>
  </div>
</template>

<script setup lang="ts">
  import Doc from "@/components/Doc.vue";

  const content = 
  `
  # 全局设置
  [[TOC]]
  ## 计息方式

  本网站有 **单利** 和 **复利** 两种[计息方式](/manual/interest-method)。由于在投资/贷款中，通常使用复利进行运算，因此本网站只在[周期性现金流](/calc/circled-cashflow)模块提供了单利和连续复利的选项。

  ## 期初/期末

  ### 期初模式（Front-end Loading）

  期初模式是指在投资或贷款的开始阶段就收取全部或大部分费用的计算方式。在这种模式下，投资者或借款人在交易开始时就需要支付一大笔费用，这通常会影响初期的投资回报或贷款的有效利率。

  **特点：**
  - 费用在交易开始时一次性支付。
  - 初期的投资回报或贷款成本较高。
  - 随着时间的推移，费用的影响逐渐减少。

  ### 期末模式（Back-end Loading）

  期末模式是指在投资或贷款的结束阶段收取费用的计算方式。在这种模式下，投资者或借款人在交易结束时才需要支付费用，这可以减少初期的投资成本或贷款利率。

  **特点：**
  - 费用在交易结束时一次性支付。
  - 初期的投资回报或贷款成本较低。
  - 随着时间的推移，费用的影响逐渐增加，特别是在交易结束时。

  ## 精度
  网站支持最高 8 位精度，用户可以按需调节。但是在某些情境下高精度运算可能会不准确（如内部收益率、贴现率等）。

  ## 货币类型

  本网站总共支持 17 种货币类型。货币类型单纯只是显示对应的货币符号，没什么用处。

  ## 时间单位

  同货币类型，没用

  ## 是否提示信息

  本网站致力于在细节处提升用户体验，因此在某些情况下会弹出提示来防止用户不经意的错误，建议打开。

  ## 默认设置

  - **计息方式**：复利
  - **期初/期末**：期末
  - **精度**：两位
  - **货币类型**：人民币
  - **时间单位**：年
  - **是否提示信息**：是
  `
</script>

<style>

</style>
