<template>
  <div>
    <Doc :markdownContent="content"/>
  </div>
</template>

<script setup lang="ts">
  import Doc from "@/views/manuals/Doc.vue";

  const content = 
  `
  # 货币时间价值（Time Value of Money, TVM）
  [[TOC]]
  ## 概念
  货币时间价值是指一定量的货币在不同时间点上的价值是不同的。这个概念基于一个基本的金融原理：由于通货膨胀和投资回报的存在，今天的一块钱比未来的一块钱更值钱。

  ## 核心原则
  1. **一鸟在手原则**：今天拥有的一笔钱比未来才能获得的同样一笔钱更有价值。
  2. **利息**：资金可以投资并随时间增长，因此未来获得的资金应该折现到当前价值。

  ## 关键要素
  - **本金**（Present Value, PV）：今天可用于投资的资金。
  - **终值**（Future Value, FV）：未来某一时间点的资金。
  - **利率**（Interest Rate）：投资的回报率。
  - **时间**（Time）：资金被投资的时长。

  ## 计算公式
  ### 未来价值（FV）
  $$ FV = PV \\times (1 + r)^n $$
  - \( FV \) 是未来价值。
  - \( PV \) 是现值（初始金额）。
  - \( r \) 是每期利率。
  - \( n \) 是计息期数。

  ### 现值（PV）
  $$ PV = \\frac{FV}{(1 + r)^n} $$
  - \( PV \) 是现值。
  - \( FV \) 是未来价值。
  - \( r \) 是每期利率。
  - \( n \) 是计息期数。

  ### 普通年金现值（PV of an Ordinary Annuity）
  $$ PV = P \\times \\left( \\frac{1 - (1 + r)^{-n}}{r} \\right) $$
  - \( P \) 是每期支付的金额。
  - \( r \) 是每期利率。
  - \( n \) 是支付次数。

  ### 普通年金未来价值（FV of an Ordinary Annuity）
  $$ FV = P \\times \\left( \\frac{(1 + r)^n - 1}{r} \\right) $$
  - \( P \) 是每期支付的金额。
  - \( r \) 是每期利率。
  - \( n \) 是支付次数。

  ## 应用
  货币时间价值的概念在金融领域广泛应用，包括但不限于：
  - **贷款**：计算贷款的现值和未来价值。
  - **投资**：评估不同时间点现金流的投资回报。
  - **退休规划**：规划退休基金，确保退休后的购买力。
  - **折旧**：计算资产随时间的价值减少。

  ## 通货膨胀的影响
  通货膨胀会降低货币的未来价值。考虑通货膨胀率时，实际利率（考虑通胀的利率）需要用来更准确地计算货币的时间价值。

  ## 结论
  理解和运用货币时间价值的概念对于个人财务管理、企业财务决策和投资规划至关重要。通过折现未来的现金流，可以做出更明智的金融选择。
  `
</script>

<style>
</style>
